//шаблон, в който описваме всяка една кола
public class Car
{
	//1. характеристики (марка, модел, цвят, конски сили) -> field / properties

	//fields
	//използват се за описание на характеристиките
	//започват с малка буква (конвенция за променливи)
	//място, в което ние описваме и съхраняваме дадена характеристика на класа
	//по правило винаги са с access modifier = private
	//не можем да променяме или задаваме стойност на полетата
	private string brand;
	private string model;
	private string color;
	private int hp;

    //properties
	//използват се за контролиран достъп до характерситиките (полетата)
	//започват с главна буква (конвенция за методи)
    //място, в което ние описваме и съхраняваме дадена характеристика на класа
    //по правило винаги са с access modifier = public
    //можем да променяме или задаваме стойност на полетата
	public string Brand { get; set; }
    public string Model { get; set; }
    public string Color { get; set; }
    public int HP { get; set; }

	//Access Modifiers
	//1. public -> можем да го достъпваме извън рамките на класа
	//2. private -> можем да го достъпваме само в рамките на класа
	//3. internal -> default -> можем да го достъпваме в рамките на проекта

    //2. действия


    //3. конструктор -> създава обекти от класа
    //всеки един клас си има default конструктор -> създава празен обект от класа
    public Car()
	{
		//нов празен обект
	}
}


